{"name":"web.search_topk","cases":[{"context":"User wants to find information about local museums in Moscow.","communication":"formal","interaction":"single_hop","challenges":"Ensure the user gets relevant results focusing specifically on Moscow's museums."},{"context":"User asks for recipes for a vegan lasagna.","communication":"casual","interaction":"single_hop","challenges":"Clarify the specific dietary needs and preferences to refine the search query."},{"context":"User is planning a trip to Japan and wants to know about popular tourist attractions.","communication":"formal","interaction":"multi_hop","challenges":"First clarify the type of attractions (cultural, natural, urban), then provide detailed information on each one."},{"context":"User is curious about the history of the iPhone.","communication":"unclear","interaction":"single_hop","challenges":"Interpret the user's intent accurately despite vague phrasing and provide concise historical information."},{"context":"User is looking for the best hiking trails in the Swiss Alps.","communication":"casual","interaction":"multi_hop","challenges":"Ask for preferred difficulty levels and time availability to tailor the search results appropriately."},{"context":"User wants to learn about quantum physics basics.","communication":"formal","interaction":"single_hop","challenges":"Provide educational resources and introductory articles on quantum physics."},{"context":"User is seeking reviews on the latest Samsung smartphone.","communication":"casual","interaction":"single_hop","challenges":"Ensure the search includes recent reviews and comparisons with other models."},{"context":"User is trying to understand the economic impact of the pandemic.","communication":"formal","interaction":"multi_hop","challenges":"Guide the user through understanding various economic indicators affected by the pandemic, such as unemployment rates and GDP changes."},{"context":"User wants to find local community events happening this weekend.","communication":"unclear","interaction":"multi_hop","challenges":"Clarify the user's location and interest to find relevant community events."},{"context":"User asks for the best places to buy organic food in their city.","communication":"casual","interaction":"single_hop","challenges":"Identify the user's location and search for local stores or markets that specialize in organic products."}]}
{"name":"web.search_wiki","cases":[{"context":"User wants to learn about the history of the Russian Revolution for a school project.","communication":"formal","interaction":"single_hop","challenges":"The user expects detailed information but needs to clarify the exact period they are interested in."},{"context":"User casually asks about famous Russian authors while relaxing after work.","communication":"casual","interaction":"single_hop","challenges":"The user might not specify the depth of information needed, requiring follow-up questions."},{"context":"User is planning a trip to Moscow and wants to know about historical landmarks.","communication":"casual","interaction":"multi_hop","challenges":"User may need additional clarification on specific types of landmarks or time periods associated with them."},{"context":"User is unsure about the origin of a phrase and asks for information.","communication":"unclear","interaction":"multi_hop","challenges":"The user might not know the exact phrase, leading to multiple iterations to clarify the query."},{"context":"User is preparing for a trivia night and asks about famous scientists.","communication":"formal","interaction":"single_hop","challenges":"User expects concise but informative responses, possibly needing to refine the query to get relevant results."},{"context":"User is curious about the life of a famous composer and asks for information.","communication":"casual","interaction":"multi_hop","challenges":"User might ask about general information and then need more specific details, requiring multiple queries."},{"context":"User wants to understand the significance of a historical event for a discussion.","communication":"formal","interaction":"single_hop","challenges":"User needs precise information, but the query might be vague, necessitating follow-up questions."},{"context":"User casually mentions wanting to learn about ancient Russian folklore.","communication":"casual","interaction":"multi_hop","challenges":"User may require multiple rounds of clarification to narrow down the type of folklore or specific stories."},{"context":"User is researching for a paper on Russian space exploration.","communication":"formal","interaction":"single_hop","challenges":"User expects focused information, but the query might be broad, requiring refinement."},{"context":"User is looking for information on famous Russian athletes for a sports trivia quiz.","communication":"formal","interaction":"single_hop","challenges":"User needs specific and accurate information, possibly requiring multiple attempts to get the right details."}]}
{"name":"math.solve","cases":[{"context":"User wants to calculate their monthly savings based on their income and expenses.","communication":"formal","interaction":"multi_hop","challenges":"Clarify the specific values for income and expenses before calculating."},{"context":"User is planning a road trip and needs to estimate fuel costs based on distance and car efficiency.","communication":"casual","interaction":"single_hop","challenges":"Needs to gather information about the distance and car efficiency before performing the calculation."},{"context":"User is trying to understand the cost of a loan payment over different periods.","communication":"formal","interaction":"multi_hop","challenges":"Clarify loan amount, interest rate, and duration before calculating the monthly payments."},{"context":"User wants to convert currency amounts between USD and EUR for a budget.","communication":"unclear","interaction":"multi_hop","challenges":"Clarify the exact amounts and directions of conversion due to ambiguous phrasing."},{"context":"User is solving a homework problem involving a complex algebraic equation with one unknown.","communication":"formal","interaction":"single_hop","challenges":"Understand the equation and solve for the variable."},{"context":"User is curious about the total cost of a subscription service over a year, including tax.","communication":"casual","interaction":"single_hop","challenges":"Clarify the monthly fee and tax rate before performing the calculation."},{"context":"User wants to split a bill evenly among friends after a dinner, including tip.","communication":"casual","interaction":"multi_hop","challenges":"Clarify the total bill amount and the number of people involved."},{"context":"User is planning a garden and needs to calculate the area required for planting a certain number of plants.","communication":"formal","interaction":"single_hop","challenges":"Clarify the dimensions of the garden and the space required per plant before calculating."},{"context":"User is trying to determine how much they need to save monthly to reach a financial goal in a certain timeframe.","communication":"unclear","interaction":"multi_hop","challenges":"Clarify the goal amount and the timeframe, then calculate the monthly saving amount."},{"context":"User is comparing the cost-effectiveness of buying in bulk versus single items.","communication":"casual","interaction":"multi_hop","challenges":"Clarify the prices and quantities for both options before performing the comparison."}]}
{"name":"weather.get_forecast","cases":[{"context":"User wants to know what the weather will be like for their upcoming week-long vacation.","communication":"formal","interaction":"single_hop","challenges":"Clarifying the exact number of days and confirming the location."},{"context":"User plans a picnic in a different city next weekend and asks for weather predictions.","communication":"casual","interaction":"multi_hop","challenges":"Needs to confirm the specific days and the different location before making the call."},{"context":"User asks about the weather for their next three days of travel.","communication":"unclear","interaction":"single_hop","challenges":"Interpreting 'next three days' correctly and asking for the destination location."},{"context":"User inquires about the weather for their friend's birthday party in 15 days in Moscow.","communication":"casual","interaction":"single_hop","challenges":"Determining the exact number of days and confirming the location."},{"context":"User wants to know the weather for their garden party scheduled in a week and a half.","communication":"formal","interaction":"multi_hop","challenges":"Converting 'a week and a half' into days and checking if the current location is correct."},{"context":"User plans to go hiking and needs the weather forecast for the next 21 days.","communication":"casual","interaction":"single_hop","challenges":"Confirming the maximum limit of days and the specific location."},{"context":"User is curious about the weather for the next month but realizes it's beyond the VA's capability.","communication":"unclear","interaction":"multi_hop","challenges":"Explaining the limitation of the tool and suggesting a smaller range."},{"context":"User is preparing for a long-term project and wants to know the weather forecast for the next 14 days in their home city.","communication":"formal","interaction":"single_hop","challenges":"Confirming the exact number of days and ensuring the location is correct."},{"context":"User asks about the weather for the next few days for a beach vacation without specifying the number of days or the location.","communication":"casual","interaction":"multi_hop","challenges":"Asking for clarification on the number of days and the location."},{"context":"User is planning a road trip across several cities over the next 7 days and wants to know the weather forecast for each city.","communication":"formal","interaction":"multi_hop","challenges":"Handling multiple locations and ensuring the number of days is correctly understood."}]}
{"name":"calendar.remove_event","cases":[{"context":"User wants to remove an event titled 'Dentist appointment' from their calendar.","communication":"formal","interaction":"single_hop","challenges":"The user does not know the exact UID of the event and needs to clarify which event to remove."},{"context":"User is planning their week and realizes they need to cancel a meeting with a colleague.","communication":"casual","interaction":"multi_hop","challenges":"The user mentions the meeting but does not specify the date; the VA must clarify the date to correctly identify and remove the event."},{"context":"User wants to delete all events related to a cancelled project from their calendar.","communication":"unclear","interaction":"multi_hop","challenges":"The user uses vague terms like 'cancelled project', requiring the VA to ask follow-up questions to identify relevant events."},{"context":"User wants to remove an event but is unsure if it's still on their calendar.","communication":"casual","interaction":"multi_hop","challenges":"VA needs to first check if the event exists, then confirm with the user before removing it."},{"context":"User wants to remove a recurring event that they no longer want to attend.","communication":"formal","interaction":"multi_hop","challenges":"The user might not remember the exact title or date of the recurring event, requiring the VA to retrieve and present options for confirmation."},{"context":"User wants to remove a specific instance of a recurring event from their calendar.","communication":"casual","interaction":"multi_hop","challenges":"The user needs to provide the date of the specific instance, which requires additional clarification."},{"context":"User wants to remove an event but also wants to reschedule it for another day.","communication":"formal","interaction":"multi_hop","challenges":"After removing the event, the VA needs to create a new one based on the user's preferences, requiring multiple steps."},{"context":"User wants to remove an event and simultaneously set a reminder for a different activity.","communication":"casual","interaction":"multi_hop","challenges":"Involves removing an event and setting a new reminder, requiring the VA to manage multiple tasks efficiently."},{"context":"User wants to remove an event that was mistakenly added multiple times on the same day.","communication":"formal","interaction":"multi_hop","challenges":"VA needs to identify and remove multiple instances of the same event, possibly asking the user to confirm each removal."},{"context":"User wants to remove an event after checking their availability for an alternative activity.","communication":"unclear","interaction":"multi_hop","challenges":"Requires VA to first check the user's schedule, then remove the conflicting event, and finally confirm the availability for the alternative activity."}]}
{"name":"calendar.get_event","cases":[{"context":"User wants to check details about an upcoming meeting that was previously set up with the assistant.","communication":"formal","interaction":"single_hop","challenges":"The user needs to recall or provide enough information for the assistant to identify the specific meeting UID."},{"context":"A user casually inquires about an event they remember setting up but can’t recall the exact details.","communication":"casual","interaction":"multi_hop","challenges":"The assistant needs to prompt for more details or suggest possible events to confirm which one the user is asking about."},{"context":"A user is planning their week and asks the assistant to find an event scheduled for a specific day.","communication":"formal","interaction":"multi_hop","challenges":"The assistant must clarify the exact day and possibly time to identify the correct event UID."},{"context":"User asks about an event that they believe is coming up soon, but they are unsure of the exact date or time.","communication":"unclear","interaction":"multi_hop","challenges":"The assistant needs to gather more information through multiple rounds of questioning to pinpoint the correct event."},{"context":"A user is curious about the details of an event they added last month, but they can’t remember much about it.","communication":"casual","interaction":"multi_hop","challenges":"The assistant must ask for additional details like the month or a keyword to find the event."},{"context":"A user wants to know about a recurring event and assumes the assistant remembers it.","communication":"formal","interaction":"multi_hop","challenges":"Clarification is needed to determine which instance of the recurring event the user is interested in."},{"context":"User asks about a past event they attended, trying to recall details from a conversation with the assistant.","communication":"unclear","interaction":"multi_hop","challenges":"The assistant may need to guide the user to provide more information, such as the date or attendees, to identify the event."},{"context":"User asks about an event related to a friend's birthday party they set up recently.","communication":"casual","interaction":"single_hop","challenges":"Assuming the assistant can identify the event based on the description and recent activity."},{"context":"A user is preparing for a presentation and needs to review the details of a meeting with their team.","communication":"formal","interaction":"multi_hop","challenges":"The assistant must ask for specifics like the team members involved or the date to narrow down the event."},{"context":"User is looking for an event related to a project they're working on, but they only have vague recollections.","communication":"casual","interaction":"multi_hop","challenges":"The assistant has to guide the user towards providing more precise information to find the event."}]}
{"name":"calendar.get_reminder","cases":[{"context":"User wants to check what their reminder is about that was set for the morning.","communication":"casual","interaction":"single_hop","challenges":"The user does not remember the exact UID of the reminder but provides contextual information to help the assistant find the right one."},{"context":"User needs to know the content of a specific reminder set for a meeting with their boss.","communication":"formal","interaction":"single_hop","challenges":"The user might provide additional details such as date or time to ensure the correct reminder is retrieved."},{"context":"User asks about a reminder related to a personal task but is unsure of the exact details.","communication":"unclear","interaction":"multi_hop","challenges":"The assistant must clarify the specifics of the reminder with the user through a series of questions to narrow down the search."},{"context":"User wants to verify the details of a reminder set for picking up a package from a friend.","communication":"casual","interaction":"single_hop","challenges":"The user remembers setting a reminder but forgot to include the UID; the assistant needs to fetch all reminders and identify the relevant one based on context."},{"context":"User inquires about a work-related reminder set for a project deadline.","communication":"formal","interaction":"single_hop","challenges":"The assistant must retrieve the reminder without additional user input, assuming the UID is known internally."},{"context":"User needs to check the content of a reminder set for a doctor's appointment, but they are confused about the day.","communication":"unclear","interaction":"multi_hop","challenges":"The assistant must engage in a dialogue to confirm the specific reminder, possibly involving checking multiple days."},{"context":"User wants to confirm the details of a reminder about a social event.","communication":"casual","interaction":"single_hop","challenges":"The user provides minimal information, requiring the assistant to infer the most likely reminder based on the available context."},{"context":"User asks about a reminder related to a bill payment due soon.","communication":"formal","interaction":"single_hop","challenges":"The user may have multiple reminders related to payments, so the assistant must ensure the correct one is fetched."},{"context":"User wants to recall the purpose of a reminder set for a weekend activity.","communication":"casual","interaction":"single_hop","challenges":"The user might only remember setting the reminder but not the exact details, requiring the assistant to use contextual clues to retrieve the correct reminder."},{"context":"User is looking for a reminder about a follow-up call but isn't sure if it was set.","communication":"unclear","interaction":"multi_hop","challenges":"The assistant must engage in a multi-step process to clarify whether a reminder exists and, if so, what it pertains to, possibly involving checking multiple reminders and asking for more details."}]}
{"name":"time.add_time","cases":[{"context":"User wants to know what day it will be 10 days from now.","communication":"casual","interaction":"single_hop","challenges":"User might not specify the current date explicitly, requiring the VA to infer the current date and time."},{"context":"User asks about the date 3 months ago from their birthday which was on May 5th.","communication":"formal","interaction":"multi_hop","challenges":"User provides a relative date reference and expects the VA to calculate the exact date based on a known event (birthday)."},{"context":"User is planning a vacation and wants to know what the date will be 2 weeks after Christmas.","communication":"casual","interaction":"single_hop","challenges":"User refers to a holiday (Christmas) and expects the VA to use a known date for the calculation."},{"context":"User asks to set a timer for 1 hour and 30 minutes from now but mentions it casually in conversation.","communication":"unclear","interaction":"single_hop","challenges":"User's request is embedded in a larger conversation, making it harder for the VA to identify the specific task."},{"context":"User inquires about the date 1 year and 1 day from today to plan an important anniversary.","communication":"formal","interaction":"single_hop","challenges":"User specifies a complex time increment which requires accurate calculation and response."},{"context":"User is scheduling a meeting and asks for the date 48 hours from now.","communication":"casual","interaction":"single_hop","challenges":"User uses a non-standard time unit (hours instead of days) which requires conversion by the VA."},{"context":"User wants to know when exactly 1 week from midnight will be, considering different time zones.","communication":"formal","interaction":"multi_hop","challenges":"User introduces the complexity of time zones, requiring the VA to clarify the user's local time zone before performing the calculation."},{"context":"User asks for the date 2 months from their last vacation which was 3 weeks ago.","communication":"casual","interaction":"multi_hop","challenges":"User provides indirect information (relative dates) and the VA must infer the exact date from the provided context."},{"context":"User mentions wanting to know the date 3 weeks from 'last Tuesday' without specifying the current date.","communication":"unclear","interaction":"multi_hop","challenges":"User's request is vague and requires the VA to both determine the current date and then calculate backwards and forwards in time."},{"context":"User asks about the date 6 months from today, but also wants to know if there are any holidays during that period.","communication":"casual","interaction":"multi_hop","challenges":"User's request involves multiple steps: calculating the future date and checking for holidays, requiring the VA to handle multiple tasks sequentially."}]}
{"name":"weather.get_weather","cases":[{"context":"User wants to know the current weather conditions in Moscow before planning an outdoor activity.","communication":"formal","interaction":"single_hop","challenges":"Requires specifying the location (Moscow)."},{"context":"A traveler asks about the weather in their current location to decide whether to carry an umbrella.","communication":"casual","interaction":"single_hop","challenges":"Uses default location parameter without explicitly mentioning the place."},{"context":"User inquires about the weather in St. Petersburg to help a friend plan a visit there.","communication":"formal","interaction":"single_hop","challenges":"Needs to clarify the specific location (St. Petersburg) for weather information."},{"context":"A local resident casually mentions wanting to know if it's raining today.","communication":"casual","interaction":"single_hop","challenges":"Implies the current location but needs to confirm the intent to check weather conditions."},{"context":"User is unsure about the weather in Sochi and asks if it's suitable for beach activities.","communication":"unclear","interaction":"multi_hop","challenges":"Needs to clarify the specific location and understand the criteria for 'suitable' weather conditions."},{"context":"Someone asks what the temperature is outside, not specifying any particular city.","communication":"casual","interaction":"single_hop","challenges":"Assumes the user means their current location without explicit confirmation."},{"context":"A tourist in Yekaterinburg asks for a detailed weather report to plan their day.","communication":"formal","interaction":"single_hop","challenges":"Clarifies the need for detailed information while specifying the location (Yekaterinburg)."},{"context":"User mentions they heard the weather was unusual and asks about it in their hometown.","communication":"unclear","interaction":"multi_hop","challenges":"Needs to identify the hometown and understand the context of 'unusual' weather."},{"context":"Someone casually asks if they should wear a coat today, implying the current location.","communication":"casual","interaction":"single_hop","challenges":"Interprets the user's intent to get weather conditions relevant to dressing appropriately."},{"context":"User inquires about the weather for an upcoming trip to Novosibirsk, needing to pack accordingly.","communication":"formal","interaction":"single_hop","challenges":"Requires understanding the specific future travel context and the need for weather information for packing."}]}
{"name":"time.get_all_timers","cases":[{"context":"User wants to check if there are any timers set for their cooking recipes.","communication":"casual","interaction":"single_hop","challenges":"User might not know the exact number of timers but wants to ensure they haven’t missed any."},{"context":"User is organizing a party and wants to keep track of multiple events using timers.","communication":"formal","interaction":"multi_hop","challenges":"Clarify if the user wants to see all timers at once or specific ones related to the party."},{"context":"User forgot about setting a timer for their laundry and now wants to check all active timers to find out if they remembered correctly.","communication":"unclear","interaction":"multi_hop","challenges":"User may need to clarify whether they are looking for a laundry-related timer or just want to see all timers."},{"context":"User is planning a day with multiple activities and wants to see all timers they set for reminders.","communication":"casual","interaction":"multi_hop","challenges":"Clarify if the user needs all timers listed or only those relevant to specific activities."},{"context":"User is preparing for an exam and has set various timers for study sessions.","communication":"formal","interaction":"single_hop","challenges":"Ensure the user understands that the request will list all timers, not just those for study sessions."},{"context":"User suspects they have accidentally left a kitchen appliance on and wants to check all active timers to ensure safety.","communication":"casual","interaction":"single_hop","challenges":"Clarify if the user is looking for a specific timer related to the kitchen appliance or all timers."},{"context":"User is preparing a meal and wonders if they have set a timer for it but can't remember.","communication":"unclear","interaction":"multi_hop","challenges":"User may need to be guided to confirm if they are looking for a meal-specific timer or all timers."},{"context":"User is trying to manage multiple tasks and wants to review all active timers to stay organized.","communication":"formal","interaction":"single_hop","challenges":"Ensure the user is aware that this will show all active timers, not just task-related ones."},{"context":"User is multitasking and wants to quickly review all active timers without having to recall each one.","communication":"casual","interaction":"single_hop","challenges":"Confirm the user's intention to view all timers rather than a specific one."},{"context":"User is coordinating with family members and wants to see all active timers to ensure everyone is on schedule.","communication":"formal","interaction":"multi_hop","challenges":"Clarify if the user needs all timers or just those related to family coordination."}]}
{"name":"calendar.add_reminder","cases":[{"context":"User wants to set a reminder for their morning workout routine.","communication":"casual","interaction":"single_hop","challenges":"Clarify the exact time of the workout."},{"context":"User needs to remember to take their medication twice a day, once in the morning and once in the evening.","communication":"formal","interaction":"multi_hop","challenges":"Determine the specific times and days for the medication reminders."},{"context":"User forgot to set a reminder for an important meeting scheduled for tomorrow.","communication":"unclear","interaction":"multi_hop","challenges":"Clarify the exact time and date of the meeting and confirm the reminder message."},{"context":"User is planning a surprise party and wants to set multiple reminders for different tasks leading up to the event.","communication":"casual","interaction":"multi_hop","challenges":"Handle multiple reminder requests and clarify the details for each one."},{"context":"User wants to remind themselves about a weekly grocery shopping trip.","communication":"formal","interaction":"single_hop","challenges":"Understand the regularity and specific time for the reminder."},{"context":"User is traveling and needs to set a reminder for adjusting to a new time zone.","communication":"unclear","interaction":"multi_hop","challenges":"Clarify the local time in the destination and adjust the reminder accordingly."},{"context":"User is preparing for an exam and needs to set daily study reminders.","communication":"casual","interaction":"multi_hop","challenges":"Determine the specific times and days for study sessions and set appropriate reminders."},{"context":"User is setting up a reminder to return borrowed items to friends.","communication":"formal","interaction":"single_hop","challenges":"Clarify the specific items and their due dates."},{"context":"User wants to set a reminder for an upcoming birthday celebration.","communication":"casual","interaction":"single_hop","challenges":"Clarify the exact date and time of the celebration."},{"context":"User is managing multiple projects and needs to set project-specific daily reminders.","communication":"formal","interaction":"multi_hop","challenges":"Handle multiple reminder requests and clarify the details for each project's schedule."}]}
{"name":"calendar.remove_reminder","cases":[{"context":"User wants to remove a reminder about picking up the dry cleaning set for tomorrow.","communication":"casual","interaction":"single_hop","challenges":"The user does not remember the exact reminder ID but provides enough context for the assistant to identify it."},{"context":"User has multiple reminders for different tasks and needs to clarify which one to remove, specifically the one related to their weekly team meeting.","communication":"formal","interaction":"multi_hop","challenges":"The assistant needs to ask follow-up questions to identify the specific reminder."},{"context":"User casually mentions they want to get rid of a reminder they no longer need, but the reminder is not immediately identifiable due to vague description.","communication":"unclear","interaction":"multi_hop","challenges":"The assistant must guide the user through identifying the correct reminder through a series of questions."},{"context":"User requests to delete all reminders related to a particular project that has been completed.","communication":"formal","interaction":"multi_hop","challenges":"The assistant needs to confirm the user's intent and then identify all relevant reminders to remove."},{"context":"User asks to remove a reminder without providing any details, expecting the assistant to know which one they are referring to based on recent interactions.","communication":"casual","interaction":"multi_hop","challenges":"The assistant must ask for additional details to correctly identify the intended reminder."},{"context":"User mistakenly sets a reminder twice and wants both removed, but only remembers part of the description.","communication":"casual","interaction":"multi_hop","challenges":"The assistant needs to find both instances of the reminder and confirm their removal."},{"context":"User is planning a trip and realizes they no longer need a reminder about packing their passport.","communication":"formal","interaction":"single_hop","challenges":"The assistant can easily identify and remove the reminder based on the clear instruction."},{"context":"User wants to remove a reminder that was set a long time ago, but they only recall a fragment of the reminder text.","communication":"unclear","interaction":"multi_hop","challenges":"The assistant must navigate through past reminders to find the one matching the user's vague description."},{"context":"User is organizing their reminders and decides to clear out old ones, mentioning a specific date.","communication":"casual","interaction":"multi_hop","challenges":"The assistant must identify reminders associated with the date and confirm each one's removal."},{"context":"User has a habit of setting daily reminders for water intake and wants to remove today’s reminder as they have already drunk enough water.","communication":"casual","interaction":"single_hop","challenges":"The assistant identifies the specific daily reminder and removes it without further clarification."}]}
{"name":"time.get_now","cases":[{"context":"User wants to know what time it is in Moscow while they are currently in New York.","communication":"formal","interaction":"single_hop","challenges":"Clarifying the need for a different timezone"},{"context":"User is planning a call with a friend in Tokyo and needs to know the current time there.","communication":"casual","interaction":"single_hop","challenges":"Understanding the need for a specific location time"},{"context":"User asks about the exact time but doesn't specify a location, assuming the VA will know their current location.","communication":"unclear","interaction":"single_hop","challenges":"Inferring the user's location without explicit information"},{"context":"User is traveling and needs to know the local time at their destination to adjust their watch.","communication":"casual","interaction":"single_hop","challenges":"Determining the user's travel destination to provide the correct time"},{"context":"User wants to set an alarm for when it's 9 AM in Paris, but they're in San Francisco.","communication":"formal","interaction":"multi_hop","challenges":"Combining the 'get_now' function with setting an alarm based on another timezone"},{"context":"User asks what time it is in their home city while traveling abroad and also wants to know how much time has passed since they left.","communication":"casual","interaction":"multi_hop","challenges":"Combining time retrieval with calculating elapsed time"},{"context":"User asks about the time in a fictional place they read about in a book.","communication":"casual","interaction":"single_hop","challenges":"Handling non-existent locations gracefully"},{"context":"User asks about the time but also mentions they're curious about the weather in the same location.","communication":"casual","interaction":"multi_hop","challenges":"Linking the time inquiry with a weather check for the same location"},{"context":"User is unsure about the exact name of the city they want to know the time for, only providing a vague description.","communication":"unclear","interaction":"single_hop","challenges":"Clarifying the city name before retrieving the time"},{"context":"User asks what time it was 3 hours ago in a specific timezone, requiring the VA to calculate the past time.","communication":"formal","interaction":"multi_hop","challenges":"Calculating a past time based on the current time retrieved"}]}
{"name":"calendar.add_event","cases":[{"context":"User wants to schedule a meeting with their colleague next Tuesday at 3 PM without any additional notes.","communication":"formal","interaction":"single_hop","challenges":"Ensure the user specifies all necessary details without prompting."},{"context":"User casually mentions setting up a dinner reservation for Friday night at 7 PM but doesn’t specify the name of the restaurant or the exact date.","communication":"casual","interaction":"multi_hop","challenges":"Clarify missing details such as the exact date and possibly the restaurant name."},{"context":"User is unsure about the exact date but remembers it’s next month on a Thursday around lunchtime.","communication":"unclear","interaction":"multi_hop","challenges":"Clarify the exact date and confirm the time slot."},{"context":"User wants to schedule a recurring weekly team meeting every Monday at 10 AM starting from next week, but does not know how to express 'recurring' in the request.","communication":"formal","interaction":"multi_hop","challenges":"Guide the user to specify the recurrence and start date."},{"context":"User wants to add a reminder to pick up groceries after work today, but isn’t sure what time they’ll finish work.","communication":"casual","interaction":"multi_hop","challenges":"Determine a reasonable time estimate based on typical work hours."},{"context":"User needs to schedule a dentist appointment but only remembers it’s sometime next week and they need a reminder 30 minutes before the appointment.","communication":"formal","interaction":"multi_hop","challenges":"Clarify the exact day and set a reminder."},{"context":"User mentions wanting to schedule a birthday party but doesn’t specify the date, time, or even whose birthday it is.","communication":"casual","interaction":"multi_hop","challenges":"Clarify all missing details including who the event is for."},{"context":"User wants to schedule a vacation trip planning meeting but is unsure about the exact dates, only knowing it should be a weekend in late October.","communication":"formal","interaction":"multi_hop","challenges":"Clarify specific dates and times."},{"context":"User casually talks about needing to remember to call a friend next Sunday afternoon but isn’t sure if they should specify an exact time.","communication":"casual","interaction":"multi_hop","challenges":"Guide the user to consider specifying an exact time for clarity."},{"context":"User wants to schedule a monthly check-in meeting for the first Wednesday of every month at 9 AM but forgets to mention the start date.","communication":"formal","interaction":"multi_hop","challenges":"Clarify the start date and guide the user through scheduling recurring events."}]}
{"name":"time.get_timer","cases":[{"context":"User wants to check the status of a previously set kitchen timer without knowing the exact UID.","communication":"casual","interaction":"single_hop","challenges":"The user needs to recall or clarify which timer they're referring to among multiple active timers."},{"context":"User sets a timer for 30 minutes during cooking and later wonders how much time is left.","communication":"casual","interaction":"multi_hop","challenges":"The user may not remember setting a specific timer or need to be reminded of the existing ones before checking the status."},{"context":"A user is working on a project and has set multiple timers, wanting to know the remaining time on one of them.","communication":"formal","interaction":"multi_hop","challenges":"Clarification required on which timer to check since the user might not recall the exact UID."},{"context":"User is jogging and remembers setting a timer but cannot recall why or what the duration was.","communication":"unclear","interaction":"multi_hop","challenges":"The user needs guidance on how to identify the specific timer among others."},{"context":"User is preparing for a meeting and wants to check if the timer for their preparation phase is still running.","communication":"formal","interaction":"single_hop","challenges":"The user must clarify the purpose or context of the timer if multiple timers are active."},{"context":"A child asks the assistant about a timer they set to remind them when to take a break from homework.","communication":"casual","interaction":"multi_hop","challenges":"The user might not know the UID and needs help identifying the correct timer among several."},{"context":"User is studying and has set a series of timers for different subjects; they want to know how much time is left on one of them.","communication":"formal","interaction":"multi_hop","challenges":"The user requires assistance in distinguishing between multiple timers for different subjects."},{"context":"A user is watching a movie and sets a timer to avoid missing the end; later, they wonder how much time is left.","communication":"casual","interaction":"single_hop","challenges":"The user may need to be reminded of the timer they set and then asked to confirm which one to check."},{"context":"User is organizing a party and has set multiple timers for various activities; they want to know the remaining time on one of these.","communication":"casual","interaction":"multi_hop","challenges":"The user needs to provide more details to identify the correct timer among several active ones."},{"context":"An elderly person who is not tech-savvy sets a timer but forgets to note down the UID; they now want to check the status.","communication":"unclear","interaction":"multi_hop","challenges":"The user needs significant guidance to understand and provide enough information to check the status of the timer."}]}
{"name":"calendar.edit_event","cases":[{"context":"User wants to change the date of their dentist appointment from the 15th to the 17th.","communication":"formal","interaction":"single_hop","challenges":"User needs to provide the specific event UID to confirm the correct appointment."},{"context":"User forgot about their gym class and needs to reschedule it to another day.","communication":"casual","interaction":"multi_hop","challenges":"User does not know the exact UID of the event; VA needs to find the event and confirm before editing."},{"context":"User wants to add a note to their upcoming meeting that it’s a video call and not an in-person meeting.","communication":"formal","interaction":"single_hop","challenges":"VA needs to clarify the exact UID of the meeting and ensure the user knows the comment field is for additional notes."},{"context":"User needs to update the time of a family dinner from 7 PM to 8 PM but isn’t sure of the event’s exact title.","communication":"unclear","interaction":"multi_hop","challenges":"VA must first identify the correct event based on context clues and then proceed with updating the time."},{"context":"User wants to move their yoga session to the morning instead of the evening but can only remember that it’s scheduled for the next week.","communication":"casual","interaction":"multi_hop","challenges":"VA has to search for events next week, identify the yoga session, and then adjust the time accordingly."},{"context":"User wants to postpone their team meeting from Tuesday to Thursday, but also needs to check if there are any other events on Thursday.","communication":"formal","interaction":"multi_hop","challenges":"VA needs to find the team meeting, change its date, and then check for other events on Thursday to avoid scheduling conflicts."},{"context":"User wants to change their doctor’s appointment time from 10 AM to 3 PM and ensure it doesn’t clash with their lunch plans.","communication":"casual","interaction":"multi_hop","challenges":"VA needs to locate the doctor's appointment, change the time, and check for other events at 3 PM to avoid scheduling overlaps."},{"context":"User wants to shift their study group session to a later time but needs confirmation that no one else in the group has any objections.","communication":"unclear","interaction":"multi_hop","challenges":"VA must identify the study group session, change the time, and then ask the user how to proceed with confirming changes with others."},{"context":"User wants to reschedule a haircut appointment due to an unexpected work commitment but doesn’t remember the exact date or time.","communication":"formal","interaction":"multi_hop","challenges":"VA has to search for all upcoming haircut appointments, verify the correct one with the user, and then adjust the schedule."},{"context":"User needs to move their weekly coffee meeting to Friday since it falls on a holiday this week.","communication":"casual","interaction":"multi_hop","challenges":"VA must find the weekly coffee meeting, identify the correct week, and then change the day to Friday, ensuring it doesn’t conflict with other events."}]}
{"name":"time.set_timer","cases":[{"context":"User wants to set a 15-minute timer before their next Zoom meeting starts.","communication":"formal","interaction":"single_hop","challenges":"Clarifying the exact time duration required for setting the timer"},{"context":"User casually mentions they need a reminder to take their medicine in 30 minutes.","communication":"casual","interaction":"single_hop","challenges":"Converting casual request into precise timer settings"},{"context":"User needs a timer for exactly 1 hour and 45 minutes to finish baking a cake.","communication":"formal","interaction":"single_hop","challenges":"Setting a timer with specific hours and minutes without confusion"},{"context":"User asks the assistant to set a timer for 'a while' while they watch a video.","communication":"unclear","interaction":"multi_hop","challenges":"Clarifying vague time duration to set a timer"},{"context":"User wants to set multiple timers for different tasks throughout the day, starting with a 2-hour study session.","communication":"formal","interaction":"multi_hop","challenges":"Managing multiple timer requests in sequence"},{"context":"User asks to set a timer for 'the movie length', assuming the assistant knows the movie's duration.","communication":"casual","interaction":"multi_hop","challenges":"Determining the exact duration of the movie to set the timer"},{"context":"User mentions setting a timer for 'a good amount of time' to finish their homework, unsure of the exact time.","communication":"unclear","interaction":"multi_hop","challenges":"Clarifying an ambiguous time request and setting an appropriate timer"},{"context":"User requests a timer to remind them when to start preparing dinner, stating they want it to go off in 2 hours and 30 minutes.","communication":"formal","interaction":"single_hop","challenges":"Setting a timer with a combination of hours and minutes"},{"context":"User casually says they need a quick reminder in 5 minutes to check on something.","communication":"casual","interaction":"single_hop","challenges":"Setting a short timer based on a casual request"},{"context":"User wants to set a timer for the maximum allowed time of 24 hours, planning a long-term reminder.","communication":"formal","interaction":"single_hop","challenges":"Handling edge case of setting a timer for the maximum allowed duration"}]}
{"name":"calendar.get_all_events","cases":[{"context":"User wants to know about their upcoming appointments for the next week.","communication":"formal","interaction":"single_hop","challenges":"User expects a structured response with specific dates and times of events."},{"context":"User casually mentions wanting to check their calendar for the weekend but is not sure of exact dates.","communication":"casual","interaction":"multi_hop","challenges":"VA needs to clarify the exact dates of the weekend and then fetch the events."},{"context":"User asks if they have any meetings related to 'project X' in the coming days.","communication":"casual","interaction":"multi_hop","challenges":"VA must understand the intent behind 'project X' and use regex to filter events accordingly."},{"context":"User is planning their week and wants to know if there are any events overlapping with their preferred work hours.","communication":"formal","interaction":"multi_hop","challenges":"VA has to clarify the user's preferred working hours and then analyze the event schedule to find overlaps."},{"context":"User casually asks about their events for today without specifying the date.","communication":"casual","interaction":"single_hop","challenges":"VA uses the default date (today) to fetch events."},{"context":"User is unsure if they have any upcoming events and casually asks if the VA knows.","communication":"unclear","interaction":"multi_hop","challenges":"VA must ask for clarification on the timeframe the user is interested in."},{"context":"User wants to know if there are any social gatherings planned in the next month, specifically those that mention 'friends'.","communication":"formal","interaction":"multi_hop","challenges":"VA must use a regex filter to find events mentioning 'friends' and extend the date range to a month."},{"context":"User asks if they need to prepare anything for the events happening in the next few days.","communication":"casual","interaction":"multi_hop","challenges":"VA needs to fetch events for the next few days and then suggest preparations based on the nature of the events."},{"context":"User is checking for any events in the past week as they are trying to remember an important meeting.","communication":"formal","interaction":"single_hop","challenges":"VA must fetch events from the past week and present them in a way that helps the user identify the meeting."},{"context":"User casually inquires if they have any free days in the next two weeks to plan a vacation.","communication":"casual","interaction":"multi_hop","challenges":"VA must fetch events for the next two weeks and then suggest free days for the user to consider."}]}
{"name":"time.remove_timer","cases":[{"context":"User wants to remove a specific timer they set earlier but only remembers the approximate purpose of the timer.","communication":"casual","interaction":"multi_hop","challenges":"Clarify which timer needs to be removed by asking the user about the specifics of the timer."},{"context":"User is confused and asks the VA to delete all timers without knowing the exact number of active timers.","communication":"unclear","interaction":"multi_hop","challenges":"VA must confirm with the user the intention to delete all timers and then proceed with multiple calls to remove each one."},{"context":"User has set multiple timers for different purposes and now wants to remove a timer related to their morning routine.","communication":"formal","interaction":"multi_hop","challenges":"VA needs to identify the specific timer related to the morning routine through a series of questions."},{"context":"User sets a timer for cooking dinner and later realizes they want to cancel it because they won't be home.","communication":"casual","interaction":"single_hop","challenges":"User might not remember the exact identifier but can describe the purpose, requiring the VA to find and remove the timer."},{"context":"User is planning to go to bed early and wants to ensure no unnecessary timers are running that could disturb them.","communication":"formal","interaction":"multi_hop","challenges":"VA must first list all active timers and then ask the user which ones to remove, possibly removing all if instructed."},{"context":"User accidentally sets multiple timers for the same event and now wants to remove all duplicates.","communication":"casual","interaction":"multi_hop","challenges":"VA needs to identify the duplicate timers and confirm their removal with the user."},{"context":"User wants to remove a timer they set last week but forgot the exact details.","communication":"unclear","interaction":"multi_hop","challenges":"VA must engage in a detailed conversation to recall the specifics of the timer and then proceed with its removal."},{"context":"User is in a hurry and quickly mentions wanting to remove a specific timer without providing much detail.","communication":"casual","interaction":"multi_hop","challenges":"VA needs to ask for more information quickly to identify and remove the correct timer."},{"context":"User wants to remove a timer they set for an event that was rescheduled, but they can't remember the exact timer details.","communication":"formal","interaction":"multi_hop","challenges":"VA must guide the user through recalling the timer details and then remove the appropriate timer."},{"context":"User wants to remove all timers related to a project they have finished.","communication":"formal","interaction":"multi_hop","challenges":"VA must first list all timers, identify those related to the project, and then confirm their removal with the user."}]}
{"name":"calendar.get_all_reminders","cases":[{"context":"User wants to know what reminders they have set for tomorrow.","communication":"formal","interaction":"single_hop","challenges":"Ensure the user's request is understood as 'tomorrow' and not 'today'. Also, ensure the VA provides a clear list of reminders without overwhelming information."},{"context":"User casually asks about their upcoming reminders, expecting to hear about any soon.","communication":"casual","interaction":"single_hop","challenges":"Clarify whether the user is asking for today's reminders or future ones. Provide a summary that fits a casual tone."},{"context":"User is preparing for a busy week and wants to review all their reminders for the entire week.","communication":"formal","interaction":"multi_hop","challenges":"Need to break down the query into daily requests since the tool only handles one day at a time. Summarize and present the data coherently over multiple interactions."},{"context":"User is unsure about a specific reminder they might have set last week but can’t recall the exact date.","communication":"unclear","interaction":"multi_hop","challenges":"VA must guide the user through narrowing down the date range and possibly reviewing multiple days to find the relevant reminder."},{"context":"User casually mentions they need to check if they have any important reminders for next Friday before making plans.","communication":"casual","interaction":"single_hop","challenges":"Ensure understanding that 'next Friday' is the date of interest and provide a casual yet comprehensive summary."},{"context":"User is trying to remember if they have any medical appointments or related reminders set for the next few days.","communication":"formal","interaction":"multi_hop","challenges":"VA needs to understand that 'medical appointments' are reminders and may need to check multiple days to provide a complete answer."},{"context":"User asks if there are any reminders set for the weekend, specifically Saturday and Sunday.","communication":"casual","interaction":"multi_hop","challenges":"Break down the query into separate days, check both days, and summarize the results in a way that fits casual conversation."},{"context":"User wants to know if they have any reminders for their child’s school events for the next three days.","communication":"formal","interaction":"multi_hop","challenges":"Understand that 'school events' are reminders, check multiple days, and summarize the findings in a clear, structured manner."},{"context":"User casually asks if they have any reminders for the day after tomorrow, wanting to plan ahead.","communication":"casual","interaction":"single_hop","challenges":"Clarify the exact date and provide a casual summary of the reminders for that day."},{"context":"User is preparing for a trip and wants to make sure they haven’t forgotten any work-related reminders for the next two weeks.","communication":"formal","interaction":"multi_hop","challenges":"Break down the query into daily checks, summarize the results in a formal and detailed manner to help with the user’s planning."}]}
{"name":"web.get_page_content","cases":[{"context":"User wants to know about a specific scientific theory and asks the voice assistant to find detailed information online.","communication":"formal","interaction":"multi_hop","challenges":"User needs to provide additional details about the specific aspects of the theory they're interested in after the assistant retrieves a general overview."},{"context":"User is preparing for a presentation and requests the voice assistant to gather detailed information from a specific webpage linked in their calendar event notes.","communication":"formal","interaction":"multi_hop","challenges":"Assistant must first retrieve the URL from the calendar event and then extract content from the web page without exposing the URL to the user."},{"context":"User casually asks the assistant to read out something funny from the internet.","communication":"casual","interaction":"single_hop","challenges":"Assistant needs to interpret what constitutes 'funny' content and present it in a way that aligns with the user's mood and expectations."},{"context":"User asks the assistant to find out the plot summary of a recent movie they watched but can't remember the title.","communication":"unclear","interaction":"multi_hop","challenges":"User may need to provide more clues about the movie, such as genre, actors, or a vague plot description, to help the assistant narrow down the search."},{"context":"User wants to check the latest news about a political figure.","communication":"formal","interaction":"single_hop","challenges":"User may need to clarify the specific politician and type of news (e.g., recent speeches, policies)."},{"context":"User asks the assistant to summarize a blog post they read a few days ago but can’t recall the exact URL.","communication":"casual","interaction":"multi_hop","challenges":"Assistant must first identify the relevant URL from past searches and then extract and summarize the content without revealing the URL."},{"context":"User is writing a paper and needs to cite a specific section of a webpage but can't access the internet directly.","communication":"formal","interaction":"multi_hop","challenges":"User needs to specify the exact part of the webpage to extract, and the assistant must ensure the citation is accurate and properly formatted."},{"context":"User casually asks the assistant to read out a recipe for a dish they found interesting in a food magazine article.","communication":"casual","interaction":"single_hop","challenges":"User may need to provide more details about the dish or the article to help the assistant locate the right content."},{"context":"User is planning a trip and wants to read a travel guide for their destination city.","communication":"formal","interaction":"single_hop","challenges":"User might need to clarify the city and the type of information they seek (e.g., historical sites, local cuisine, transportation options)."},{"context":"User casually asks the assistant to find out who wrote a famous quote they heard recently.","communication":"casual","interaction":"multi_hop","challenges":"User might need to provide more details about the quote, such as a fragment or context, to help the assistant locate the source."}]}
